app/views/articles/show.html.erb

<%= render @article.comments %>
<!-- <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]